{"data":{"site":{"siteMetadata":{"title":"zehengl","author":"Zeheng Li"}},"markdownRemark":{"id":"752a526e-494f-51b6-97ab-44857c0029bc","excerpt":"Traditional Development Analysis Design Coding Testing Deploy logically sound but assumes predictability, difficult to react to unforeseen changes Agile…","html":"<h2>Traditional Development</h2>\n<ul>\n<li>Analysis</li>\n<li>Design</li>\n<li>Coding</li>\n<li>Testing</li>\n<li>Deploy</li>\n<li>logically sound but assumes predictability, difficult to react to unforeseen changes</li>\n</ul>\n<h2>Agile Manifesto</h2>\n<ul>\n<li>Individuals and interactions over processes and tools</li>\n<li>Working software over comprehensive documentation</li>\n<li>Customer collaboration over contract negotiation</li>\n<li>Responding to change over following a plan</li>\n</ul>\n<h3>Principles behind the Agile Manifesto</h3>\n<ol>\n<li>Our highest priority is to satisfy the customer through early and continuous delivery of valuable software</li>\n<li>Welcome changing requirements, even late in development. Agile processes harness change for the customer’s competitive advantage</li>\n<li>Deliver working software frequently, from a couple of weeks to a couple of months, with a preference to the shorter timescale</li>\n<li>Business people and developers must work together daily during the project</li>\n<li>Build projects around motivated individuals. Give them the environment and support they need, and trust them to get the job done.</li>\n<li>The most efficient and effective method of conveying information to and within a development team is face- to-face conversation</li>\n<li>Working software is the primary measure of progress</li>\n<li>Agile processes promote sustainable development. Sponsors, developers, and users should be able to maintain a constant pace indefinitely</li>\n<li>Continuous attention to tech. excellence and good design enhances agility</li>\n<li>Simplicity (the art of maximizing the amount of work not done)is essential</li>\n<li>The best architectures, requirements, and designs emerge from self-organizing teams</li>\n<li>At regular intervals, the team reflects on how to become more effective, then tunes and adjusts its behavior accordingly</li>\n</ol>\n<h3>APM (Agile Project Management) Framework</h3>\n<ul>\n<li><strong>Envision</strong>\nDetermine the product vision and project scope, the project community, and how the team will work together</li>\n<li><strong>Speculate</strong>\nDevelop a feature-based release, milestone, and iteration plan to deliver on the vision</li>\n<li><strong>Explore</strong>\nDeliver tested features in a short timeframe, constantly seeking to reduce the risk and uncertainty of the project</li>\n<li><strong>Adapt</strong>\nReview the delivered results, the current situation, and the team’s performance, and adapt as necessary</li>\n<li><strong>Close</strong>\nConclude the project, pass along key learning’s, and celebrate</li>\n</ul>\n<h3>Scrum</h3>\n<ul>\n<li>a methodology for software development that adheres to Agile principles of <em>iterative</em> and <em>incremental</em> development</li>\n</ul>","frontmatter":{"title":"Agile Scrum Note 01 - Introduction","date":"December 06, 2015","description":"Introduction of Agile."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/agile-scrum-notes-01/","previous":null,"next":{"fields":{"slug":"/pip-install-mysqlclient-on-macos/"},"frontmatter":{"title":"How to pip install MYSQL-python/mysqlclient on macOS"}}}}