{"data":{"site":{"siteMetadata":{"title":"zehengl","author":"Zeheng Li"}},"markdownRemark":{"id":"b8789d70-221b-5cf4-8c84-373633d01101","excerpt":"Product backlog Collection of everything that the team could do which adds value to the customer Defined in terms of user stories and epics All items in the…","html":"<h2>Product backlog</h2>\n<ul>\n<li>Collection of everything that the team could do which adds value to the customer</li>\n<li>Defined in terms of user stories and epics</li>\n<li>All items in the backlog must be ranked in priority order</li>\n<li>\n<p>Needs to be well defined for the next 2 or 3 Sprints</p>\n<ul>\n<li>Rest could be defined at a high level</li>\n</ul>\n</li>\n<li>It is a “live” list maintained by the Product Owner</li>\n<li>\n<p>Backlog items can be:</p>\n<ul>\n<li>Functional or non-functional requirements</li>\n<li>Technical upgrades</li>\n<li>Significant bug-fixes</li>\n</ul>\n</li>\n</ul>\n<h2>Product, release and sprint backlog</h2>\n<ul>\n<li>Release backlog is a subset of the Product backlog (everything targeted to a release)</li>\n<li>Sprint backlog is a subset of the Release backlog (everything targeted to a particular Sprint)</li>\n<li>Product backlog may be in terms of epics, Release backlog may be in terms of stories and Sprint backlog should be down to the sub-story and “task” level</li>\n</ul>\n<h2>User story</h2>\n<ul>\n<li>Is the most granular unit of requirement expressed by the Product Owner</li>\n<li>\n<p>Provides a simple medium for:</p>\n<ul>\n<li>Gathering basic information about stories,</li>\n<li>Recording high-level requirements,</li>\n<li>Developing work estimates, and</li>\n<li>Defining acceptance tests</li>\n</ul>\n</li>\n<li>Acts as agreements between customers and team members to discuss detail requirements during an iteration</li>\n<li>\n<p>3 C’s:</p>\n<ul>\n<li>Card</li>\n<li>Conversation</li>\n<li>Confirmation</li>\n</ul>\n</li>\n<li>\n<p><strong>I.N.V.E.S.T.</strong>:</p>\n<ul>\n<li>Independent</li>\n<li>Negotiable</li>\n<li>Valuable</li>\n<li>Estimable</li>\n<li>Small</li>\n<li>Testable</li>\n</ul>\n</li>\n<li>\n<p>Example user story: formal</p>\n<ul>\n<li><strong>As a</strong> &#x3C;role>: <em>who</em> wants this piece of functionality</li>\n<li><strong>I want to</strong> &#x3C;goal/desire>: <em>what</em> the user wants</li>\n<li><strong>so that</strong> &#x3C;benefit>: <em>why</em> the user wants it</li>\n<li>Priority</li>\n<li>Estimate</li>\n<li>See Example:</li>\n<li><strong>As an</strong> employee, <strong>I want to</strong> be able to purchase a parking pass online <strong>so that</strong> I can save time AND be able to park my car safely in the basement.</li>\n</ul>\n</li>\n</ul>\n<h2>Story card information</h2>\n<ul>\n<li>Story identifier and name</li>\n<li>Story description: A few sentences that describes the feature</li>\n<li>Story type (C=customer domain, T=technology domain)</li>\n<li>Estimated work effort: The estimated work effort needed to deliver the story (this is given by the team)</li>\n<li>Estimated Value Points</li>\n<li>Requirements uncertainty: An “exploration factor” for the story</li>\n<li>Story dependencies:</li>\n<li>Acceptance tests: Basis on which the customer team will accept or reject</li>\n</ul>\n<h2>Multiple stories may be required to complete a feature</h2>\n<p>Feature: As a credit analyst I need the ability to check a customer’s credit rating.</p>\n<ul>\n<li>Story 1: As a credit analyst I need the ability to check the prior payment history with this customer.</li>\n<li>Story 2: As a credit analyst I need the ability to check this customer’s credit bureau status.</li>\n<li>Story 3: As a credit analyst I need the ability to calculate our internal credit rating based on history and credit report.</li>\n</ul>\n<h2>Epics</h2>\n<p>Way of grouping stories together - by a higher level goal or aggregating a large number of sub-stories into a big story</p>\n<h2>Writing good stories</h2>\n<ul>\n<li>Use example templates – As a [role] I can [feature] so that [reason] •Make the stories small (use 3” X 5” index cards so that you don’t write too much)</li>\n<li>\n<p>Make it testable by giving acceptance criteria</p>\n<ul>\n<li>Given [context] &#x3C;and/or [some more context]> When [event] Then [outcome] &#x3C;and/or [another outcome]></li>\n<li>Example: Given account balance is negative and no direct deposit is scheduled on the day when the account holder tries to withdraw money then the bank will deny the request and send the account holder an alert</li>\n</ul>\n</li>\n<li>“Connect the dots” by thinking of all possible scenarios that could arise (use case thinking)</li>\n</ul>\n<h2>Splitting user stories</h2>\n<ul>\n<li>A story should be small (no more than 40 man hours of effort)</li>\n<li>Keeping stories small allows the team to build incrementally, getting\nvalidation along the way</li>\n<li>It requires considerable effort on part of the Product Owner to write requirements at that level of granularity</li>\n<li>\n<p>We shall look at ways in which larger stories can be split into multiple smaller stories</p>\n<ul>\n<li>Big Picture</li>\n<li>Research v.s. Action: Spend a time-boxed period on research before moving to the action story if the story requires research</li>\n<li>Spike v.s. Implementation: Spend some time doing experimentation to gain better understanding before moving to implementation</li>\n<li>Main flow v.s. Alternate flow: Implement the happy path first, then take up the alternate paths</li>\n<li>Buy v.s. Build: Spend some time to see if what you need already exists and can be bought - a widget, an algorithm or component</li>\n<li>User Experience</li>\n<li>Batch v.s. Online: Keep the user interactions away for some time by implementing a batch system</li>\n<li>Single user v.s. Multi-user: Keep concurrency, access control issues aside for some time, think about single user</li>\n<li>API only v.s. User interface: Build the fancy UI later, first think about the programmatic interface</li>\n<li>Generic UI v.s. Custom UI: Use basic widgets to begin with - add the fancy controls later</li>\n<li>Others</li>\n<li>Static v.s. Dynamic: Use static or cached information to begin with - think about dynamic later</li>\n<li>Ignore errors v.s. Handle errors: Add more sophisticated exception handling later, first implement core logic</li>\n<li>Transient v.s. Persistent: Worry about persisting data later, first work on transient information</li>\n<li>Low fidelity v.s. High fidelity: Improve quality of output progressively</li>\n<li>Small scale v.s. Large scale: Forget about scale issues for some time, then add scalability</li>\n<li>Unreliable v.s. Reliable: Perfect uptime is expensive, build it step-by-step</li>\n</ul>\n</li>\n</ul>","frontmatter":{"title":"Agile Scrum Note 05: Artifacts","date":"January 10, 2016","description":"Some Artifacts that are used in Scrum projects."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/agile-scrum-notes-05/","previous":{"fields":{"slug":"/agile-scrum-notes-04/"},"frontmatter":{"title":"Agile Scrum Note 04: Ceremonies"}},"next":{"fields":{"slug":"/pip-install-mysqlclient-on-macos/"},"frontmatter":{"title":"How to pip install MYSQL-python/mysqlclient on macOS"}}}}